---
kind: type
id: T:Autodesk.Revit.DB.Structure.DistributionType
source: html/e6161b8e-a592-d54c-dbe4-68ab9f186292.htm
---
# Autodesk.Revit.DB.Structure.DistributionType

The type of the distribution

## Syntax (C#)
```csharp
public enum DistributionType
```